yearnext/ysf/bsp/stm32f1xx/map/map_uart.c
    if(dev->RxConfig == MCU_UART_ENABLE_RX_ISR)
    {
        LL_USART_ClearFlag_RXNE(Uart[port]);
        LL_USART_EnableIT_RXNE(Uart[port]);
    }
	
    NVIC_EnableIRQ(UartIrqn[port]); 
    NVIC_SetPriority(UartIrqn[port], dev->Priority);  
    
    LL_USART_Enable(Uart[port]);
}

/**
 *******************************************************************************
 * @brief       set uart tx call back
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *callback       call back function
 * @param       [in/out]  *param          call back param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_SetTxCallback(uint8_t port, void (*callback)(void*), void *param)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    UartTxCallback[port].Callback = callback;
    UartTxCallback[port].Param = param;
}

/**
 *******************************************************************************
 * @brief       set uart rx call back
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *callback       call back function
 * @param       [in/out]  *param          call back param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_SetRxCallback(uint8_t port, void (*callback)(void*, uint8_t), void *param)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    UartRxCallback[port].Callback = callback;
    UartRxCallback[port].Param = param;
}

/**
 *******************************************************************************
 * @brief       deinit uart
 * @param       [in/out]  port            uart id
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_Fini(uint8_t port)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    LL_USART_DeInit(Uart[port]);
}

/**
 *******************************************************************************
 * @brief       send data
 * @param       [in/out]  port            uart id
 * @param       [in/out]  sendData        send data
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_SendData(uint8_t port, uint8_t sendData)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    Uart[port]->DR = sendData;
}

/**
 *******************************************************************************
 * @brief       receive data
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *sendData       receive data            
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
uint8_t Map_Uart_ReceiveData(uint8_t port)
{
    hal_assert(IS_UART_PORT_INVAILD(port));

    return (uint8_t)Uart[port]->DR;
}

/**
 *******************************************************************************
 * @brief       enable uart tx
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_TxConnect(uint8_t port)
{
    hal_assert(IS_UART_PORT_INVAILD(port));

    //< enable uart tx
	Uart[port]->CR1 |= 0x08;
    
    //< clear uart tx isr flag
	Uart[port]->SR  &= ~0x40;
    
    //< enable uart tx isr
	Uart[port]->CR1 |= 0x40;
}

/**
 *******************************************************************************
 * @brief       disable uart tx
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_TxDisconnect(uint8_t port)
{
	hal_assert(IS_UART_PORT_INVAILD(port));

    //< disable uart isr
	Uart[port]->CR1 &= ~0x08;
    
    //< clear uart tx isr flag
	Uart[port]->CR1 &= ~0x40;
    
    //< disable uart tx isr
	Uart[port]->SR  &= ~0x40;
}

/**
 *******************************************************************************
 * @brief       enable uart rx
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_RxConnect(uint8_t port)
{
	hal_assert(IS_UART_PORT_INVAILD(port));

    //< enable uart rx
	Uart[port]->CR1 |= 0x04;
    
    //< clear uart rx isr flag
	Uart[port]->SR  &= ~0x20;
    
    //< enable uart rx isr flag
	Uart[port]->CR1 |= 0x20;
}

/**
 *******************************************************************************
 * @brief       disable uart rx
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_RxDisconnect(uint8_t port)
{
	hal_assert(IS_UART_PORT_INVAILD(port));

    //< disable uart rx
	Uart[port]->CR1 &= ~0x04;
    
    //< clear uart rx isr flag
	Uart[port]->CR1 &= ~0x20;
    
    //< disable uart rx isr
	Uart[port]->SR  &= ~0x20;
}

/**
 *******************************************************************************
 * @brief       get tx status
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
bool Map_Uart_IsTxComplet(uint8_t port)
{
	hal_assert(IS_UART_PORT_INVAILD(port));
    
	return (Uart[port]->SR & 0x40) ? (Uart[port]->SR &= ~0x40, true) \
                                   : (false);
}

/**
 *******************************************************************************
 * @brief       clear tx flag
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
bool Map_Uart_IsRxComplet(uint8_t port)
{
	hal_assert(IS_UART_PORT_INVAILD(port));

	return (Uart[port]->SR & 0x20) ? (Uart[port]->SR &= ~0x20, true) \
                                   : (false);
}

/**
 *******************************************************************************
 * @brief       register uart api
 * @param       [in/out]  void
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
void Map_Uart_API_Register(void **ops)
{
    hal_assert(IS_PTR_NULL(ops));
    
    *ops = (void *)&_uart_ops;
}

/**
 *******************************************************************************
 * @brief       uart1 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
#ifdef USART1
void USART1_IRQHandler(void)
{
    if (Map_Uart_IsTxComplet(MCU_UART_1) == true)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_1].Callback))
        {
            UartTxCallback[MCU_UART_1].Callback(UartTxCallback[MCU_UART_1].Param);
        }
    }
    
    if (Map_Uart_IsRxComplet(MCU_UART_1) == true)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_1].Callback))
        {
            UartRxCallback[MCU_UART_1].Callback(UartRxCallback[MCU_UART_1].Param, Uart[MCU_UART_1]->DR);
        }
    }
}
#endif

/**
 *******************************************************************************
 * @brief       uart2 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
#ifdef USART2
void USART2_IRQHandler(void)
{
    if (Map_Uart_IsTxComplet(MCU_UART_2) == true)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_2].Callback))
        {
            UartTxCallback[MCU_UART_2].Callback(UartTxCallback[MCU_UART_2].Param);
        }
    }
    
    if (Map_Uart_IsRxComplet(MCU_UART_2) == true)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_2].Callback))
        {
            UartRxCallback[MCU_UART_2].Callback(UartRxCallback[MCU_UART_2].Param, Uart[MCU_UART_2]->DR);
        }
    }
}
#endif

/**
 *******************************************************************************
 * @brief       uart3 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
#ifdef USART3
void USART3_IRQHandler(void)
{
    if (Map_Uart_IsTxComplet(MCU_UART_3) == true)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_3].Callback))
        {
            UartTxCallback[MCU_UART_3].Callback(UartTxCallback[MCU_UART_3].Param);
        }
    }
    
    if (Map_Uart_IsRxComplet(MCU_UART_3) == true)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_3].Callback))
        {
            UartRxCallback[MCU_UART_3].Callback(UartRxCallback[MCU_UART_3].Param, Uart[MCU_UART_3]->DR);
        }
    }
}
#endif

/**
 *******************************************************************************
 * @brief       uart4 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
#ifdef UART4
void UART4_IRQHandler(void)
{
    if (Map_Uart_IsTxComplet(MCU_UART_4) == true)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_4].Callback))
        {
            UartTxCallback[MCU_UART_4].Callback(UartTxCallback[MCU_UART_4].Param);
        }
    }
    
