yearnext/ysf/bsp/stm32f1xx/map/map_uart.c
    if (Map_Uart_IsRxComplet(MCU_UART_4) == true)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_4].Callback))
        {
            UartRxCallback[MCU_UART_4].Callback(UartRxCallback[MCU_UART_4].Param, Uart[MCU_UART_4]->DR);
        }
    }  
}
#endif

/**
 *******************************************************************************
 * @brief       uart5 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
#ifdef UART5
void UART5_IRQHandler(void)
{
    if (Map_Uart_IsTxComplet(MCU_UART_5) == true)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_5].Callback))
        {
            UartTxCallback[MCU_UART_5].Callback(UartTxCallback[MCU_UART_5].Param);
        }
    }
    
    if (Map_Uart_IsRxComplet(MCU_UART_5) == true)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_5].Callback))
        {
            UartRxCallback[MCU_UART_5].Callback(UartRxCallback[MCU_UART_5].Param, Uart[MCU_UART_5]->DR);
        }
    }
}
#endif

/**
 *******************************************************************************
 * @brief       hal uart unit test function
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
void Hal_Uart_Test(void)
{
//    struct Hal_Uart_Device uart = 
//    {
//        .Port = MCU_UART_2,
//        .Baud = 115200,
//        .Parity = MCU_UART_PARTY_NONE,
//        .StopBits = MCU_UART_STOP_BITS_1,
//        .WordLen = MCU_UART_WORD_LEN_8B,
//
//        .RxConfig = MCU_UART_ENABLE_RX,
//        .TxConfig = MCU_UART_ENABLE_TX,
//        
//        .Priority = 0x02,
//    };
//    
//    uint16_t i;

//    Hal_Uart_Open(&uart);
//    Hal_Uart_Init(&uart);

    while(1)
    {
//        for(i=0; i<100; i++);
//        Hal_Uart_SendData(&uart, 0xFF);
    }
}

#endif

/** @}*/     /** map uart component */

/**********************************END OF FILE*********************************/
